In [1]:
#we imported the panda libary so we can use it to analyze this data set
import pandas as pd
# we used the read_csv function so we can upload and access our dataset
df = pd.read_csv('C:/Users/Retshard/Downloads/t.csv')

In [7]:
# we used the info function so we can see an overview abouth the entries(row) count , the number and names of the columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [51]:
# we used the head function to view the first n numbers of raw data according to the number we inserted inside the brackets
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,NaN,C

In [36]:
# weused the describe function to get the descriptive statistics about the data set and some how the data is alittle bit normalized
#and this can be concluded from the close values between the (mean and the 50%), (max and 75%) and the (25% and the min)
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.002015,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
# is used  this function to check the number of duplicate values between rows
sum(df.duplicated())

0

In [9]:
# i used the fillna function som i can fill the Nan values in the age column withe mean of the age column
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [10]:
#to check that the change was successfully applied
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
# i w3anted to know the number of the passsengers that get on the ship from each station
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [29]:
# i wanted to know the number of the male and female passsangers on the ship
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [30]:
# i usedthe value_counts function to get the number of the survivors
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [34]:
# i used the loc to acces the rows of the male survivors so i can know the count of the dead and alive 
df['Survived'].loc[df['Sex']=='male'].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [35]:
# i used the loc to acces the rows of the female survivors so i can know the count of the dead and alive 
df['Survived'].loc[df['Sex']=='female'].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [47]:
# i used the loc function so i can access the rows of each Pclass and how many of each class is alive and how many are dead
df['Survived'].loc[df['Pclass']==1].value_counts()

1    136
0     80
Name: Survived, dtype: int64

In [49]:
# i used the loc function so i can access the rows of each Pclass and how many of each class is alive and how many are dead
df['Survived'].loc[df['Pclass']==2].value_counts()

0    97
1    87
Name: Survived, dtype: int64

In [50]:
# i used the loc function so i can access the rows of each Pclass and how many of each class is alive and how many are dead
df['Survived'].loc[df['Pclass']==3].value_counts()

0    372
1    119
Name: Survived, dtype: int64

In [59]:
# i created a new DataFrame with only the dead passangers so i can investigate the data of the dead closely
dead = df[df['Survived'] == 0]
dead.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S

In [74]:
# i extracted the cabin data of the rows that contain the cabin data not null to see if there is a common factor between them
places_dead = dead[~dead['Cabin'].isna()].Cabin.value_counts()
places_dead.head(30)

G6             2
C22 C26        2
C23 C25 C27    2
F G73          2
D26            2
C124           2
D50            1
A10            1
C86            1
B38            1
C95            1
D46            1
E58            1
C65            1
C30            1
B37            1
A14            1
D48            1
E46            1
E38            1
B71            1
C68            1
F G63          1
C46            1
B22            1
D30            1
E77            1
F38            1
D6             1
B82 B84        1
Name: Cabin, dtype: int64

In [61]:
# i created a new DataFrame with only the alive passangers so i can investigate the data of the alive closely
alive = df[df['Survived'] == 1]
alive.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [71]:
# i extracted the cabin data of the rows that contain the cabin data not null to see if there is a common factor between them
places_alive =alive[~alive['Cabin'].isna()].Cabin.value_counts()

In [77]:
places_alive.head(30)

B96 B98            4
E101               3
F33                3
B18                2
B20                2
B5                 2
D                  2
E121               2
D36                2
C93                2
F4                 2
B35                2
D35                2
B77                2
C125               2
E8                 2
F2                 2
D17                2
E33                2
E24                2
C92                2
B57 B59 B63 B66    2
C23 C25 C27        2
B28                2
C52                2
D33                2
D20                2
E25                2
C126               2
G6                 2
Name: Cabin, dtype: int64

In [80]:
# i wanted to see if there is a correlation between them 
places_alive.corr(places_dead)

0.4622501635210242

<b>Conclusion<b>

From my point of view i can see that the dataset of Titanic Disaster is such an important data as we can learn from the data to prevent such kind of disasters 
we can  detect the number of male and female passangers ,the survivors among them
people who were siblings and the place where they get into the ship
i did my investiagtion welling to find somesort of relation ship between the status of survival and the cabin number or the age and sex of the passanger 
i enjoyed the investiagtion process and i can't wait until i learn machine learning so i cna feed the model with this dataset and see what else we can find.